In [ ]:
import pandas as pd
import numpy as np
import re

In [ ]:
from sklearn.datasets import fetch_openml

titanic = fetch_openml("titanic", version=1, as_frame=True)

df = titanic.frame
df.head()

##import dataset as dataframe and return top 5 rows

In [ ]:

col_name = df.columns[3]
print(col_name)
##find column name

In [ ]:
print(df.iloc[:,3])
grouped = df.groupby(col_name)
##grouped by sex

In [ ]:

missing = df.isnull().sum()
print (missing)
##missing entries
#handling missing values
median_age = df['age]'].median()
df['age'].fillna(median_age, inplace=True)

In [ ]:
df.duplicated().sum()

##df.drop_duplicates(inplace=True)
##drop rows with missing entries

In [ ]:
df.dropna(inplace=True)

In [ ]:
print(df.columns)

In [ ]:
# 3. Inspect the "Sex" column for inconsistencies and standardize values.
df.sex.value_counts

In [ ]:
df.describe()

In [ ]:
Q1_age = df['age'].quantile(0.25)
Q3_age = df['age'].quantile(0.75)
IQR_age = Q3_age - Q1_age

Q1_fare = df['fare'].quantile(0.25)
Q3_fare = df['fare'].quantile(0.75)
IQR_fare = Q3_fare - Q1_fare

print(IQR_age, IQR_fare)

In [ ]:
age_outliers = df[(df['age'] < (Q1_age - 1.5*IQR_age)) | (df['age'] > (Q3_age + 1.5*IQR_age))]
fare_outliers = df[(df['fare'] < (Q1_fare - 1.5*IQR_fare)) | (df['fare'] > (Q3_fare + 1.5*IQR_fare))]

In [ ]:
##encode the embarked column
from sklearn.preprocessing import LabelEncoder

label_encoder = 
df['embarked_encoded'] = label_encoder.fit_transform(df['embarked'])

In [ ]:
df['label_encoder'].value_counts()

In [ ]:

# 8. Clean the Name 
import re
df['name'] = df['name'].apply(
        lambda x: re.sub(r'(Mr\.|Mrs\.|Dr\.|Miss\.|Master\.)', '', x) 
        )

df['name'] = df.name.str.lower()

df.head(n=10)

In [59]:
# 9. 
bins = [0,12, 18, 64, 100]
labels = ['Child', 'Teen', 'Adult', 'Senior']

df['age_group'] = pd.cut(df['age'], bins=bins, labels= labels)

df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,age_group
0,1.0,1,"allen, elisabeth walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Adult
1,1.0,1,"allison, hudson trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Child
2,1.0,0,"allison, helen loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",Child
3,1.0,0,"allison, hudson joshua creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON",Adult
4,1.0,0,"allison, hudson j c (bessie waldo daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",Adult